Пансион83/src/Documents/РегистрацияУслуги/РегистрацияУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияУслуги</name>
  <basedOn>Document.СчетПроживания</basedOn>
  <registerRecords>AccumulationRegister.РегистрацияУслуг</registerRecords>
  <attributes>
    <name>AccountingDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ParentDoc</name>
    <type>
      <types>DocumentRef.Размещение</types>
      <types>DocumentRef.СоставКвоты</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.БроньУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>GuestGroup</name>
    <type>
      <types>CatalogRef.ГруппыГостей</types>
    </type>
  </attributes>
  <attributes>
    <name>Room</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </attributes>
  <attributes>
    <name>Resource</name>
    <type>
      <types>CatalogRef.Ресурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Client</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientType</name>
    <type>
      <types>CatalogRef.ТипыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientTypeConfirmationText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolioCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>DocumentRef.СчетПроживания</types>
    </type>
  </attributes>
  <attributes>
    <name>IdentificationCard</name>
    <type>
      <types>CatalogRef.КартаИД</types>
    </type>
  </attributes>
  <attributes>
    <name>Service</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

Пансион83/src/Enums/ExternalProcessingTypes/ExternalProcessingTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExternalProcessingTypes</name>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
  <enumValues>
    <name>Report</name>
  </enumValues>
  <enumValues>
    <name>Algorithm</name>
  </enumValues>
</mdclass:Enum>

Пансион83/src/Documents/СчетПроживания/СчетПроживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетПроживания</name>
  <basedOn>Catalog.ШаблоныОпераций</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <attributes>
    <name>IsClosed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsClosedAuthor</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>IsClosedDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FolioCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ParentDoc</name>
    <type>
      <types>DocumentRef.Размещение</types>
      <types>DocumentRef.Бронирование</types>
      <types>DocumentRef.БроньУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>Client</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>GuestGroup</name>
    <type>
      <types>CatalogRef.ГруппыГостей</types>
    </type>
  </attributes>
  <attributes>
    <name>Room</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </attributes>
  <attributes>
    <name>DateTimeFrom</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateTimeTo</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentSection</name>
    <type>
      <types>CatalogRef.ОтделОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>CreditLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsMaster</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoNotUpdateCompany</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HotelProduct</name>
    <type>
      <types>CatalogRef.ПутевкиКурсовки</types>
    </type>
  </attributes>
  <attributes>
    <name>DebtDecision</name>
    <type>
      <types>EnumRef.DebtsDecisionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DebtDecisionAuthor</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>DebtDecisionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DebtDecisionRemarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FolioDiscountCard</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>FolioDiscountType</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

Пансион83/src/Catalogs/ВнешниеОбработки/ВнешниеОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеОбработки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>UserExits</name>
      <description>User exits</description>
    </items>
    <items>
      <name>HotelOccupationDaily</name>
      <description>EN='Гостиница occupation daily'; RU='Остатки свободных номеров по дням'; DE='Überreste von Zimmern an den Nachmittagen'</description>
    </items>
  </predefined>
  <attributes>
    <name>ExternalProcessingType</name>
    <type>
      <types>EnumRef.ExternalProcessingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalProcessingStorage</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Algorithm</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FileName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FileLoadTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FileLastChangeTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Пансион83/src/Documents/РегистрацияУслуги/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура PostToServiceRegistration()
	Movement = RegisterRecords.РегистрацияУслуги.Add();
	
	Movement.RecordType = AccumulationRecordType.Expense;
	Movement.Period = Date;
	
	// Fill properties
	FillPropertyValues(Movement, ЛицевойСчет);
	FillPropertyValues(Movement, ThisObject);
	
	// Fill accounting date
	Movement.УчетнаяДата = ?(ЗначениеЗаполнено(AccountingDate), AccountingDate, BegOfDay(Date));
	
	// Fill resource
	If ЗначениеЗаполнено(ParentDoc) Тогда
		If TypeOf(ParentDoc) = Type("DocumentRef.БроньУслуг") Тогда
			Movement.Ресурс = ParentDoc.Ресурс;
		EndIf;
	EndIf;
	
	// Resources
	Movement.Сумма = Sum;
	
	// Attributes
	//Movement.Цена = cmRecalculatePrice(Movement.Сумма, Movement.Количество);
	
	RegisterRecords.РегистрацияУслуги.Write();
КонецПроцедуры //PostToServiceRegistration

//-----------------------------------------------------------------------------
Процедура Posting(pCancel, pMode)
	If ThisObject.DataExchange.Load Тогда
		Return;
	EndIf;
	// Post to service registration
	PostToServiceRegistration();
КонецПроцедуры //Posting

//-----------------------------------------------------------------------------
Процедура pmFillByFolio(pFolio) Экспорт
	If pFolio = Documents.СчетПроживания.EmptyRef() Тогда
		Return;
	EndIf;
	// ЛицевойСчет and folio currency
	ЛицевойСчет = pFolio;
	FolioCurrency = ЛицевойСчет.FolioCurrency;
	If ЗначениеЗаполнено(ЛицевойСчет.Гостиница) Тогда
		If Гостиница <> ЛицевойСчет.Гостиница Тогда
			Гостиница = ЛицевойСчет.Гостиница;
			SetNewNumber(TrimAll(Гостиница.GetObject().pmGetPrefix()));
		EndIf;
	EndIf;
	// Guest group, client, ГруппаНомеров
	GuestGroup = pFolio.ГруппаГостей;
	Client = pFolio.Клиент;
	Room = pFolio.НомерРазмещения;
	// Fill parent document
	ParentDoc = pFolio.ДокОснование;
	// Fill resource
	If ЗначениеЗаполнено(ParentDoc) Тогда
		If TypeOf(ParentDoc) = Type("DocumentRef.БроньУслуг") Тогда
			Resource = ParentDoc.Ресурс;
		EndIf;
	EndIf;
КонецПроцедуры //pmFillByFolio

//-----------------------------------------------------------------------------
Function pmCheckDocumentAttributes(pMessage, pAttributeInErr) Экспорт
	vHasErrors = False;
	pMessage = "";
	pAttributeInErr = "";
	vMsgTextRu = "";
	vMsgTextEn = "";
	vMsgTextDe = "";
	If НЕ ЗначениеЗаполнено(Гостиница) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Гостиница> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Гостиница> attribute should be filled!" + Chars.LF;
		vMsgTextDe = vMsgTextDe + "<Гостиница> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Гостиница", pAttributeInErr);
	EndIf;
	If НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Лицевой счет> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<СчетПроживания> attribute should be filled!" + Chars.LF;
		vMsgTextDe = vMsgTextDe + "<СчетПроживания> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "СчетПроживания", pAttributeInErr);
	EndIf;
	If НЕ ЗначениеЗаполнено(Service) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Услуга> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Услуга> attribute should be filled!" + Chars.LF;
		vMsgTextDe = vMsgTextDe + "<Услуга> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Услуга", pAttributeInErr);
	EndIf;
	If НЕ ЗначениеЗаполнено(FolioCurrency) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Валюта фолио> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<СчетПроживания Валюта> attribute should be filled!" + Chars.LF;
		vMsgTextDe = vMsgTextDe + "<СчетПроживания Валюта> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "ВалютаЛицСчета", pAttributeInErr);
	EndIf;
	// Check that only one service per day per guest is allowed
	If ЗначениеЗаполнено(Service) And Service.ServiceRegistrationIsTurnedOn And Service.MaxOneServicePerDayIsAllowed Тогда
		vQry = New Query();
		vQry.Text = 
		"SELECT
		|	РегистрацияУслуги.Ref
		|FROM
		|	Document.РегистрацияУслуги AS РегистрацияУслуги
		|WHERE
		|	РегистрацияУслуги.Ref <> &qDoc
		|	AND РегистрацияУслуги.Posted
		|	AND РегистрацияУслуги.УчетнаяДата = &qAccountingDate
		|	AND РегистрацияУслуги.Клиент = &qClient
		|	AND РегистрацияУслуги.Услуга = &qService
		|
		|ORDER BY
		|	РегистрацияУслуги.PointInTime";
		vQry.SetParameter("qDoc", Ref);
		vQry.SetParameter("qAccountingDate", AccountingDate);
		vQry.SetParameter("qClient", Client);
		vQry.SetParameter("qService", Service);
		vDocs = vQry.Execute().Unload();
		If vDocs.Count() > 0 Тогда
			vHasErrors = True; 
			vMsgTextRu = vMsgTextRu + "Разрешено использовать только одну услугу в день!" + Chars.LF;
			vMsgTextEn = vMsgTextEn + "One Услуга per day is allowed only!" + Chars.LF;
			vMsgTextDe = vMsgTextDe + "Ein Услуга pro Tag ist erlaubt!" + Chars.LF;
			pAttributeInErr = ?(pAttributeInErr = "", "Клиент", pAttributeInErr);
		EndIf;
	EndIf;
	// Call external algorithm if any
	vUserExitProc = Справочники.ВнешниеОбработки.ServiceRegistrationDocumentAttributesCheck;
	If vUserExitProc.ExternalProcessingType = Перечисления.ExternalProcessingTypes.Algorithm And НЕ IsBlankString(vUserExitProc.Algorithm) Тогда
		Execute(TrimAll(vUserExitProc.Algorithm));
	EndIf;
	// Check results
	If vHasErrors Тогда
		pMessage = "ru='" + TrimAll(vMsgTextRu) + "';" + "en='" + TrimAll(vMsgTextEn) + "';" + "de='" + TrimAll(vMsgTextDe) + "';";
	EndIf;
	Return vHasErrors;
EndFunction //pmCheckDocumentAttributes

//-----------------------------------------------------------------------------
Процедура pmFillAuthorAndDate() Экспорт
	Date = CurrentDate();
	Автор = ПараметрыСеанса.ТекПользователь;
	AccountingDate = BegOfDay(Date);
КонецПроцедуры //pmFillAuthorAndDate

//-----------------------------------------------------------------------------
Процедура pmFillAttributesWithDefaultValues() Экспорт
	// Fill author and document date
	pmFillAuthorAndDate();
	// Fill from session parameters
	If НЕ ЗначениеЗаполнено(Гостиница) Тогда
		Гостиница = ПараметрыСеанса.ТекущаяГостиница;
	EndIf;
	If ЗначениеЗаполнено(Гостиница) Тогда
		FolioCurrency  = Гостиница.FolioCurrency;
	EndIf;
КонецПроцедуры //pmFillAttributesWithDefaultValues

//-----------------------------------------------------------------------------
Процедура Filling(pBase)
	// Fill attributes with default values
	pmFillAttributesWithDefaultValues();
	// Fill from the base
	If ЗначениеЗаполнено(pBase) Тогда
		If TypeOf(pBase) = Type("DocumentRef.СчетПроживания") Тогда
			pmFillByFolio(pBase);
		EndIf;
	EndIf;
КонецПроцедуры //Filling

//-----------------------------------------------------------------------------
Процедура BeforeWrite(pCancel, pWriteMode, pPostingMode)
	Перем vMessage, vAttributeInErr;
	If ThisObject.DataExchange.Load Тогда
		Return;
	EndIf;
	If pWriteMode = DocumentWriteMode.Posting Тогда
		pCancel	= pmCheckDocumentAttributes(vMessage, vAttributeInErr);
		If pCancel Тогда
			WriteLogEvent(NStr("en='Document.DataValidation';ru='Документ.КонтрольДанных';de='Document.DataValidation'"), EventLogLevel.Warning, ThisObject.Metadata(), ThisObject.Ref, NStr(vMessage));
			ВызватьИсключение NStr(vMessage);
		EndIf;
	EndIf;
КонецПроцедуры //BeforeWrite

//-----------------------------------------------------------------------------
Процедура OnSetNewNumber(pStandardProcessing, pPrefix)
	vPrefix = "";
	If ЗначениеЗаполнено(Гостиница) Тогда
		vPrefix = TrimAll(Гостиница.GetObject().pmGetPrefix());
	EndIf;
	If ЗначениеЗаполнено(ПараметрыСеанса.ТекущаяГостиница) Тогда
		vPrefix = TrimAll(ПараметрыСеанса.ТекущаяГостиница.GetObject().pmGetPrefix());
	EndIf;
	If vPrefix <> "" Тогда
		pPrefix = vPrefix;
	EndIf;
КонецПроцедуры //OnSetNewNumber
